export default {
    data() {
        return {
            weekDays: [{
                day: '星期一',
                date: '04月20号',
                timeSlot: ['14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期二',
                date: '04月21号',
                timeSlot: ['14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期三',
                date: '04月22号',
                timeSlot: ['08:00 - 12:00', '10:00 - 12:00', '14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期四',
                date: '04月23号',
                timeSlot: ['08:00 - 12:00', '10:00 - 12:00', '14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期五',
                date: '04月24号',
                timeSlot: ['08:00 - 12:00', '10:00 - 12:00', '14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期六',
                date: '04月25号',
                timeSlot: ['08:00 - 12:00', '10:00 - 12:00', '14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }, {
                day: '星期日',
                date: '04月26号',
                timeSlot: ['08:00 - 12:00', '10:00 - 12:00', '14:00 - 16:00', '18:00 - 20:00', '20:00 - 21:00']
            }],
            course: {
                courseId: '1',
                courseName: '中国近代史',
                teacherName: '王海云',
                teachingCode: 'k110012'
            }
        };
    },

    components: {},

    computed: {},

    created() {},

    mounted() {},

    methods: {}
}